# St7GetPathOutline

Returns the outline colour scheme for load paths.

long St7GetPathOutline(long uID, long* Outline)

Input Parameters

uID

Strand7 model file ID.

Output Parameters

Outline

One of tlNone, tlTemplate, tlGroup, tlPathNumber or tlColour.

Load Path Entity Display